{"pageProps":{"_nextI18Next":{"initialI18nStore":{"en":{"top":{"intro":{"title":"Hi! I'm Nekodigi.","body":"I have been making art, applications, etc for 8 years. Recently, I have been focusing on web application development. My dream is to create applications that many people use😎\nNice to meet you all!"},"myProjects":{"title":"My Projects","body":"Here's an app you can try right now!\nIf you want to see all my work, please visit my Youtube or blog.","projects":[{"title":"Mapman","body":"Created by a travel enthusiast who wasn't satisfied with Google Maps. Conquer all your destinations!","url":"https://mapman-frontend.vercel.app/map","image":"/images/en/top/Mapman.png"},{"title":"Creative Magic","body":"The culmination of three years of learning generative art. High-quality art on your smartphone too.","url":"https://play.google.com/store/apps/details?id=com.Nekodigi.CreativeMagic","image":"/images/en/top/CreativeMagic.png"},{"title":"Pinyin OCR","body":"An extension that displays Chinese Pinyin with just one click. One tool for both character recognition from images and translation.","url":"https://chrome.google.com/webstore/detail/pinyin-ocr/pnaenhlejhkoamfjgcfmkpjekpodohga","image":"/images/en/top/PinyinOCR.png"},{"title":"Artifact Sim","body":"An unique app that predicts the final score of artifacts. Make Genshin Impact even more enjoyable.","url":"https://artifact.nekodigi.com/","image":"/images/en/top/ArtifactSim.png"},{"title":"Thanks website","body":"Post your feedback from your smartphone just like chatting. Updating your website daily has never been easier.","url":"https://thankyou.fbyamaguchi.org/","image":"/images/en/top/ThanksWeb.png"},{"title":"LINE GPT","body":"Use ChatGPT on LINE. A recommended service for developers who want to add their own commands.","url":"https://lin.ee/TRJzQJp","image":"/images/jp/top/LineGPT.png"}]},"socialMedia":{"title":"Social Media","body":"I share hundreds of pieces of art and apps on social media platforms like YouTube and GitHub! I also provide regular insights into my creative process and useful tips, so be sure to check it out! 👍","socialMedias":[{"title":"Youtube","body":"Art that focuses on appearance and technical interest.","url":"https://www.youtube.com/c/Nekodigi"},{"title":"Github","body":"Free source code for almost all web apps/art and other works.","url":"https://github.com/Nekodigi"},{"title":"Blog","body":"A wide range of behind the scenes of development and other interests.","url":"https://nekodigi-hatenablog-com.translate.goog/archive?_x_tr_sl=ja&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=wapp"},{"title":"Google Play","body":"Works that focus on interactive experiences that cannot be experienced in videos.","url":"https://play.google.com/store/apps/dev?id=8989861170574890555"},{"title":"Linkedin","body":"A place to share my career and skills. I'm looking for a oversea job!","url":"https://www.linkedin.com/in/kazuhiro-uetsuhara-536667202/"},{"title":"Twitter(X)","body":"Follow us for the latest updates!","url":"https://x.com/nekodigi"}]},"experience":{"title":"Experience","body":"List of my past work experiences, personal development projects, and qualifications obtained.\nFor more details, please check my LinkedIn.","markdown":"## Art Development\n\nIn addition to practical experience using Unity, I have six years of extensive personal development experience with tools such as Processing, GLSL, and p5.js.\n\n- [Internship] TeamLab Interactive Engineer (Aug 2023 - Sep 2023)\n    - Worked with Unity, HLSL, Compute Shader, Shader Lab, and C#\n    - Implemented a particle system from scratch and integrated it with fluid simulations\n    - Developed a system where particles, trails, and fields interact with each other\n    - Planned, produced, and exhibited a project based on a theme I devised\n\n- [Internship] Cyber Agent Visual Effects Artist (Oct 2021 - Nov 2021)\n    - Utilized Unity and Shuriken\n    - Completed a two-month course combining lectures and hands-on practice\n    - Created game effects in line with a specific theme using the current [NovaShader](https://github.com/CyberAgentGameE)\n\n- [Personal Project] [Nekodigi YouTube](https://www.youtube.com/c/Nekodigi) (Jan 2019 - Present)\n    - Published nearly 250 videos on generative art using Processing, p5.js, Unity, and other tools\n    - Showcased works that are both realistic and technically interesting, based on precise algorithms\n\n- [Personal Project] [Nekodigi Blog](https://nekodigi.hatenablog.com/archive/category/Art) (Jan 2019 - Present)\n    - Shared development logs for almost all my works\n    - Provided information across various fields such as Art, AI, Web development, and hobbies\n    - Published over 500 articles\n\n- [Personal Project] [Nekodigi X](https://x.com/nekodigi) (Dec 2024 - Present)\n    - Introduced my latest works along with videos\n    - Focused primarily on projects created using ShaderToy\n\n- [Personal Project] [Nekodigi Google Play](https://play.google.com/store/apps/dev?id=8989861170574890555) (Oct 2023 - Present)\n    - Developed real-time interactive art pieces for smartphones\n    - Utilized Unity, Compute Shader, and HLSL for development\n\n- [Certification] [CG Creator Certification – Expert](https://www.linkedin.com/in/kazuhiro-uetsuhara-536667202/details/certifications/)\n    - Comprehensive knowledge of CG production related to video editing, CG animation, intellectual property, and more.\n\n## Web Development\n\nStarting with practical experience, I have also taken on numerous individual development projects that encompass planning, production, and promotion. For development, I utilize technologies such as Next.js, Node.js, and GCP.\n\n- [Work] [STORES.inc](http://STORES.inc) Frontend Engineer Nov 2023 - Dec 2023\n    - Developed using Ruby on Rails and Vue.js\n    - Functionality development related to bulk data management\n- [Work] Digitex Yamaguchi [Thank You Website](https://thankyou.fbyamaguchi.org/) Backend Engineer Aug 2022 - Nov 2023\n    - Developed using Next.js, Node.js, and Line API\n    - Involved in the creation of a prototype and the entire backend development process\n    - Currently published as an [OSS](https://thankyou.fbyamaguchi.org/) as part of volunteer activities aimed at advancing digitalization in Yamaguchi Prefecture\n- [Personal Development] [Mapman](https://mapman-frontend.vercel.app/map)\n    - Based on Google Map API, achieving millisecond-level response times using caching and advanced filtering\n    - Implemented unique features such as Drag & Drop route searching, compass functionality, and prioritization features\n- [Personal Development] [Artifact Sim](https://artifact.nekodigi.com/)\n    - Processes images from the Genshin Impact game screen using only opencv.js and tesseract in the browser, without needing a server, for automatic input of values from images\n    - Possesses advanced filtering and calculation features\n- [Personal Development] [Cowriter](https://cowriter-pi.vercel.app/)\n    - A web text editor powered by ChatGPT\n    - Allows for sentence revisions and questions about text with the click of a button\n- [Personal Development] [Others](https://nekodigi.hatenablog.com/archive/category/Web%20Dev)\n    - Introduced various applications such as a transfer app, IoT device management app, chat app, and Chrome extensions on my blog\n- [Certificate] [AWS Cloud Solutions Architect Specialization](https://www.linkedin.com/in/kazuhiro-uetsuhara-536667202/details/certifications/)\n    - Constructed optimal cloud configurations considering costs, performance, and ease of management\n    - Optimized costs and performance through data accumulation and analysis\n- [Certification] [Applied Information Technology Engineer Examination](https://www.linkedin.com/in/kazuhiro-uetsuhara-536667202/details/certifications/)\n    - A national IT qualification covering the following fields\n    - Technology-related areas such as networking, algorithms, and databases\n    - Management-related areas such as project management and system auditing\n    - Strategy-related areas such as system strategy, business strategy, corporate activities, and legal matters\n\n## AI Development\n\nIn addition to applying ChatGPT and Google AI products, I'm also focusing on foundational research, such as implementing Diffusion models from scratch.\n\n- [Internship] [Ghelia.Inc](http://Ghelia.Inc) AI Research and Development Intern Jan 2024 - Jun 2024\n    - Implemented a Diffusion model from scratch using PyTorch and conducted research on image generation that leverages its mechanism, which has been featured in [external publicity](https://note.com/ghelia/n/nf9376a816b46)\n    - Also engaged in image restoration and training large-scale models using ABCI (government-provided) while utilizing image generation techniques\n    - Development with a focus on maintainability and reproducibility using tools like Mypy and Hydra\n- [Certificate] [Deep Learning Specialization](https://www.linkedin.com/in/kazuhiro-uetsuhara-536667202/details/certifications/)\n    - Theoretical understanding and practical application of time series analysis, image analysis, and text models\n    - Understanding of natural language processing, LSTM, facial recognition, object detection, and CNN\n- [Certificate] [CS50 AI](https://cs50.harvard.edu/ai/2024/)\n    - Theoretical understanding of artificial intelligence, along with practical projects in rule-based AI and game AI creation\n    - Understanding of PageRank, genetic algorithms, neural networks, Attention, and morphological analysis\n- [Personal Projects] [Nekodigi Blog](https://nekodigi.hatenablog.com/archive/category/AI)\n    - Document scanning in the browser using Tesseract and OpenCV.js\n    - Developed a text editor integrated with ChatGPT and a Line Bot\n    - Reproduced an AI VTuber and gesture control through posture estimation\n    - Real-time text correction AI using VAE\n    - Real-time image generation using GAN based on mouse input\n\n## Others\n\nI actively participate in government and corporate-sponsored events and am dedicated to obtaining qualifications and improving my skills.\n\n- [Accepted] Tobitate Study Abroad JAPAN High School Student Program 7th Term Aug 2022 - Sep 2022\n    - Conducted research on the social implementation of programming at Malaya University\n    - Participated in a seminar organized by the Ministry of Education in Malaysia\n- [Speaker] Technology Education Exhibit [Creative Magic](https://nekodigi.hatenablog.com/entry/2021/09/25/%E3%80%90%E6%8A%80%E8%82%B2%E5%B1%95%E3%80%91%E5%88%9D%E3%82%81%E3%81%A6%E3%81%AE%E7%99%BB%E5%A3%87%EF%BC%81Creative_Magic-%E7%99%92%E3%81%97%E3%81%A8%E5%89%B5%E9%80%A0%E3%81%AE%E3%82%A2%E3%83%BC) Sep 2021 [Writing VFX](https://nekodigi.hatenablog.com/entry/2023/08/05/124605) Aug 2023\n    - Real-time simulation of hundreds of thousands of particles using GPU\n    - Enabled interaction between different algorithms through a unified interface\n    - Implemented advanced features including fluid simulation, FFT blur, and ChatGPT integration\n- [Certificate] [Entrepreneurship Specialization](https://www.linkedin.com/in/kazuhiro-uetsuhara-536667202/details/certifications/)\n    - Understanding of necessary skills for entrepreneurship, including fundraising, planning, pitching, management, and marketing strategies\n- [Qualifications] [Eiken Grade 1 | TOEIC 940](https://www.linkedin.com/in/kazuhiro-uetsuhara-536667202/details/certifications/)"},"skill":{"title":"Skill","body":"This is a list of technologies used in development.\nPlease use it as a reference for your own development and work requests."},"contact":{"title":"Contact","body":"You can contact me through LinkedIn, email, Twitter (X), or YouTube. I'm looking forward to your work inquiries, feedback, and more!\nEmail: ndeji69@gmail.com"}},"common":{"footer":{"languages":[{"abbr":"en","name":"English"},{"abbr":"ja","name":"日本語"}],"category":[{"name":"Services","items":[{"alt":"Creative Magic","url":"https://play.google.com/store/apps/details?id=com.Nekodigi.CreativeMagic"},{"alt":"Web Answer Sheet","url":"https://webans.nekodigi.com/"},{"alt":"Artifact Sim","url":"https://artifact.nekodigi.com/"}]},{"name":"Legal","items":[{"alt":"Privacy Policy","url":"/terms/privacy"},{"alt":"Act on Specified Commercial Transactions","url":"/terms/commercial-law"}]}]}}}},"initialLocale":"en","ns":["top","common"],"userConfig":{"debug":false,"i18n":{"locales":["en","ja"],"defaultLocale":"en"},"default":{"debug":false,"i18n":{"locales":["en","ja"],"defaultLocale":"en"}}}}},"__N_SSG":true}